-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Авг 12 2020 г., 14:29
-- Версия сервера: 10.3.13-MariaDB-log
-- Версия PHP: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `intelliants`
--

-- --------------------------------------------------------

--
-- Структура таблицы `admin_menu`
--

CREATE TABLE `admin_menu` (
  `id` int(10) UNSIGNED NOT NULL,
  `parent_id` int(11) NOT NULL DEFAULT 0,
  `order` int(11) NOT NULL DEFAULT 0,
  `title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `icon` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `uri` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `permission` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_menu`
--

INSERT INTO `admin_menu` (`id`, `parent_id`, `order`, `title`, `icon`, `uri`, `permission`, `created_at`, `updated_at`) VALUES
(1, 0, 1, 'Dashboard', 'fa-bar-chart', '/', NULL, NULL, NULL),
(2, 0, 2, 'Admin', 'fa-tasks', '', NULL, NULL, NULL),
(3, 2, 3, 'Users', 'fa-users', 'auth/users', NULL, NULL, NULL),
(4, 2, 4, 'Roles', 'fa-user', 'auth/roles', NULL, NULL, NULL),
(5, 2, 5, 'Permission', 'fa-ban', 'auth/permissions', NULL, NULL, NULL),
(6, 2, 6, 'Menu', 'fa-bars', 'auth/menu', NULL, NULL, NULL),
(7, 2, 7, 'Operation log', 'fa-history', 'auth/logs', NULL, NULL, NULL),
(8, 0, 0, 'News', 'fa-edit', 'news', NULL, '2020-08-12 03:00:28', '2020-08-12 04:10:10'),
(9, 0, 0, 'Company', 'fa-comments-o', 'companies', NULL, '2020-08-12 03:00:37', '2020-08-12 04:10:30');

-- --------------------------------------------------------

--
-- Структура таблицы `admin_operation_log`
--

CREATE TABLE `admin_operation_log` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `path` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `method` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ip` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `input` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_operation_log`
--

INSERT INTO `admin_operation_log` (`id`, `user_id`, `path`, `method`, `ip`, `input`, `created_at`, `updated_at`) VALUES
(1, 1, 'admin/auth/login', 'POST', '127.0.0.1', '{\"username\":\"admin\",\"password\":\"admin\",\"remember\":\"1\",\"_token\":\"NubCDQGI0lAnCQVgPvbq4M9vry4Y5oLyrSH2CehD\"}', '2020-08-12 03:00:13', '2020-08-12 03:00:13'),
(2, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 03:00:13', '2020-08-12 03:00:13'),
(3, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:19', '2020-08-12 03:00:19'),
(4, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:21', '2020-08-12 03:00:21'),
(5, 1, 'admin/auth/menu', 'POST', '127.0.0.1', '{\"parent_id\":\"0\",\"title\":\"News\",\"icon\":\"fa-bars\",\"uri\":\"news\",\"roles\":[\"1\",null],\"permission\":null,\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\"}', '2020-08-12 03:00:28', '2020-08-12 03:00:28'),
(6, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 03:00:28', '2020-08-12 03:00:28'),
(7, 1, 'admin/auth/menu', 'POST', '127.0.0.1', '{\"parent_id\":\"0\",\"title\":\"Company\",\"icon\":\"fa-bars\",\"uri\":\"companies\",\"roles\":[\"1\",null],\"permission\":null,\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\"}', '2020-08-12 03:00:37', '2020-08-12 03:00:37'),
(8, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 03:00:37', '2020-08-12 03:00:37'),
(9, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 03:00:38', '2020-08-12 03:00:38'),
(10, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:39', '2020-08-12 03:00:39'),
(11, 1, 'admin/companies/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:40', '2020-08-12 03:00:40'),
(12, 1, 'admin/companies', 'POST', '127.0.0.1', '{\"title\":\"company test01\",\"description\":\"company desc test01\",\"date\":\"2020-08-12\",\"status\":\"off\",\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/companies\"}', '2020-08-12 03:00:46', '2020-08-12 03:00:46'),
(13, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 03:00:46', '2020-08-12 03:00:46'),
(14, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:47', '2020-08-12 03:00:47'),
(15, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:49', '2020-08-12 03:00:49'),
(16, 1, 'admin/news', 'POST', '127.0.0.1', '{\"title\":\"news test01\",\"description\":\"news test01 desc\",\"status\":\"off\",\"companies\":[\"1\",null],\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:00:54', '2020-08-12 03:00:54'),
(17, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:00:54', '2020-08-12 03:00:54'),
(18, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:56', '2020-08-12 03:00:56'),
(19, 1, 'admin/companies/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:00:57', '2020-08-12 03:00:57'),
(20, 1, 'admin/companies', 'POST', '127.0.0.1', '{\"title\":\"company test02\",\"description\":\"company desc test02\",\"date\":\"2020-08-12\",\"status\":\"off\",\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/companies\"}', '2020-08-12 03:01:01', '2020-08-12 03:01:01'),
(21, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 03:01:01', '2020-08-12 03:01:01'),
(22, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:02', '2020-08-12 03:01:02'),
(23, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:04', '2020-08-12 03:01:04'),
(24, 1, 'admin/news', 'POST', '127.0.0.1', '{\"title\":\"news test02\",\"description\":\"news desc test02\",\"status\":\"off\",\"companies\":[\"1\",\"2\",null],\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:01:10', '2020-08-12 03:01:10'),
(25, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:01:11', '2020-08-12 03:01:11'),
(26, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:20', '2020-08-12 03:01:20'),
(27, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:22', '2020-08-12 03:01:22'),
(28, 1, 'admin/news/1', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:24', '2020-08-12 03:01:24'),
(29, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:27', '2020-08-12 03:01:27'),
(30, 1, 'admin/news/2', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:28', '2020-08-12 03:01:28'),
(31, 1, 'admin/companies/2/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:35', '2020-08-12 03:01:35'),
(32, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:01:37', '2020-08-12 03:01:37'),
(33, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:02:10', '2020-08-12 03:02:10'),
(34, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:02:11', '2020-08-12 03:02:11'),
(35, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:02:13', '2020-08-12 03:02:13'),
(36, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:02:18', '2020-08-12 03:02:18'),
(37, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:02:20', '2020-08-12 03:02:20'),
(38, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:02:52', '2020-08-12 03:02:52'),
(39, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:04:15', '2020-08-12 03:04:15'),
(40, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:04:17', '2020-08-12 03:04:17'),
(41, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:04:18', '2020-08-12 03:04:18'),
(42, 1, 'admin/news', 'POST', '127.0.0.1', '{\"title\":\"news test03\",\"description\":\"news desc test03\",\"status\":\"off\",\"companies\":[null],\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:04:29', '2020-08-12 03:04:29'),
(43, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:04:30', '2020-08-12 03:04:30'),
(44, 1, 'admin/news/3', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:04:32', '2020-08-12 03:04:32'),
(45, 1, 'admin/companies/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:04:40', '2020-08-12 03:04:40'),
(46, 1, 'admin/news/3', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:04:41', '2020-08-12 03:04:41'),
(47, 1, 'admin/news/3/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:04:45', '2020-08-12 03:04:45'),
(48, 1, 'admin/news/3', 'PUT', '127.0.0.1', '{\"title\":\"news test03\",\"description\":\"news desc test03\",\"status\":\"off\",\"companies\":[\"1\",\"2\",null],\"_token\":\"wKYabo1zOMqJrFnSnlU4Cfc4MkZdNcDroFxzcWcN\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\\/3\"}', '2020-08-12 03:04:48', '2020-08-12 03:04:48'),
(49, 1, 'admin/news/3', 'GET', '127.0.0.1', '[]', '2020-08-12 03:04:48', '2020-08-12 03:04:48'),
(50, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:04:51', '2020-08-12 03:04:51'),
(51, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:08:25', '2020-08-12 03:08:25'),
(52, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:08:29', '2020-08-12 03:08:29'),
(53, 1, 'admin/auth/setting', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:08:39', '2020-08-12 03:08:39'),
(54, 1, 'admin/auth/setting', 'GET', '127.0.0.1', '[]', '2020-08-12 03:08:42', '2020-08-12 03:08:42'),
(55, 1, 'admin/auth/setting', 'GET', '127.0.0.1', '[]', '2020-08-12 03:10:13', '2020-08-12 03:10:13'),
(56, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:10:16', '2020-08-12 03:10:16'),
(57, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 03:16:50', '2020-08-12 03:16:50'),
(58, 1, 'admin/companies/1/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:16:54', '2020-08-12 03:16:54'),
(59, 1, 'admin/companies/1', 'PUT', '127.0.0.1', '{\"title\":\"company test01\",\"description\":\"company desc test01\",\"date\":\"2020-08-12\",\"status\":\"on\",\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/companies\"}', '2020-08-12 03:16:57', '2020-08-12 03:16:57'),
(60, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 03:16:57', '2020-08-12 03:16:57'),
(61, 1, 'admin/companies/2/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:16:59', '2020-08-12 03:16:59'),
(62, 1, 'admin/companies/2', 'PUT', '127.0.0.1', '{\"title\":\"company test02\",\"description\":\"company desc test02\",\"date\":\"2020-08-12\",\"status\":\"on\",\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/companies\"}', '2020-08-12 03:17:01', '2020-08-12 03:17:01'),
(63, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 03:17:01', '2020-08-12 03:17:01'),
(64, 1, 'admin/companies/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:04', '2020-08-12 03:17:04'),
(65, 1, 'admin/companies', 'POST', '127.0.0.1', '{\"title\":\"company test03\",\"description\":\"company desc test03\",\"date\":\"2020-08-12\",\"status\":\"off\",\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/companies\"}', '2020-08-12 03:17:12', '2020-08-12 03:17:12'),
(66, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 03:17:13', '2020-08-12 03:17:13'),
(67, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:13', '2020-08-12 03:17:13'),
(68, 1, 'admin/news/1/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:16', '2020-08-12 03:17:16'),
(69, 1, 'admin/news/1', 'PUT', '127.0.0.1', '{\"title\":\"news test01\",\"description\":\"news test01 desc\",\"status\":\"on\",\"companies\":[\"1\",null],\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:17:18', '2020-08-12 03:17:18'),
(70, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:17:18', '2020-08-12 03:17:18'),
(71, 1, 'admin/news/2/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:20', '2020-08-12 03:17:20'),
(72, 1, 'admin/news/2', 'PUT', '127.0.0.1', '{\"title\":\"news test02\",\"description\":\"news desc test02\",\"status\":\"on\",\"companies\":[\"1\",\"2\",null],\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:17:21', '2020-08-12 03:17:21'),
(73, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:17:22', '2020-08-12 03:17:22'),
(74, 1, 'admin/news/3/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:24', '2020-08-12 03:17:24'),
(75, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:29', '2020-08-12 03:17:29'),
(76, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:31', '2020-08-12 03:17:31'),
(77, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:17:32', '2020-08-12 03:17:32'),
(78, 1, 'admin/news', 'POST', '127.0.0.1', '{\"title\":\"news test04\",\"description\":\"news desc test04\",\"status\":\"on\",\"companies\":[\"1\",\"2\",\"3\",null],\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:17:42', '2020-08-12 03:17:42'),
(79, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:17:42', '2020-08-12 03:17:42'),
(80, 1, 'admin/news/4', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:22:57', '2020-08-12 03:22:57'),
(81, 1, 'admin/companies/8/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:23:01', '2020-08-12 03:23:01'),
(82, 1, 'admin/news/4', 'GET', '127.0.0.1', '[]', '2020-08-12 03:23:01', '2020-08-12 03:23:01'),
(83, 1, 'admin/companies/8', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:23:10', '2020-08-12 03:23:10'),
(84, 1, 'admin/news/4', 'GET', '127.0.0.1', '[]', '2020-08-12 03:23:10', '2020-08-12 03:23:10'),
(85, 1, 'admin/companies/6/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:23:15', '2020-08-12 03:23:15'),
(86, 1, 'admin/news/4', 'GET', '127.0.0.1', '[]', '2020-08-12 03:23:16', '2020-08-12 03:23:16'),
(87, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:23:20', '2020-08-12 03:23:20'),
(88, 1, 'admin/auth/login', 'GET', '127.0.0.1', '[]', '2020-08-12 03:28:58', '2020-08-12 03:28:58'),
(89, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:28:58', '2020-08-12 03:28:58'),
(90, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:28:58', '2020-08-12 03:28:58'),
(91, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:41:21', '2020-08-12 03:41:21'),
(92, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:41:23', '2020-08-12 03:41:23'),
(93, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:41:24', '2020-08-12 03:41:24'),
(94, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:41:28', '2020-08-12 03:41:28'),
(95, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:41:28', '2020-08-12 03:41:28'),
(96, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:41:30', '2020-08-12 03:41:30'),
(97, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:41:52', '2020-08-12 03:41:52'),
(98, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:41:53', '2020-08-12 03:41:53'),
(99, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:41:56', '2020-08-12 03:41:56'),
(100, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:42:24', '2020-08-12 03:42:24'),
(101, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:42:30', '2020-08-12 03:42:30'),
(102, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:42:54', '2020-08-12 03:42:54'),
(103, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:42:55', '2020-08-12 03:42:55'),
(104, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:43:07', '2020-08-12 03:43:07'),
(105, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:43:08', '2020-08-12 03:43:08'),
(106, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:43:12', '2020-08-12 03:43:12'),
(107, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:43:30', '2020-08-12 03:43:30'),
(108, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:43:30', '2020-08-12 03:43:30'),
(109, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:44:12', '2020-08-12 03:44:12'),
(110, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:49:36', '2020-08-12 03:49:36'),
(111, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:49:38', '2020-08-12 03:49:38'),
(112, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:49:39', '2020-08-12 03:49:39'),
(113, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:21', '2020-08-12 03:50:21'),
(114, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:23', '2020-08-12 03:50:23'),
(115, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:24', '2020-08-12 03:50:24'),
(116, 1, 'admin/companies/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:26', '2020-08-12 03:50:26'),
(117, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:29', '2020-08-12 03:50:29'),
(118, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:30', '2020-08-12 03:50:30'),
(119, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:34', '2020-08-12 03:50:34'),
(120, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:45', '2020-08-12 03:50:45'),
(121, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:51', '2020-08-12 03:50:51'),
(122, 1, 'admin/auth/users', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:53', '2020-08-12 03:50:53'),
(123, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:56', '2020-08-12 03:50:56'),
(124, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:57', '2020-08-12 03:50:57'),
(125, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:50:59', '2020-08-12 03:50:59'),
(126, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:05', '2020-08-12 03:51:05'),
(127, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\",\"per_page\":\"10\"}', '2020-08-12 03:51:08', '2020-08-12 03:51:08'),
(128, 1, 'admin/companies/1', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:10', '2020-08-12 03:51:10'),
(129, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:12', '2020-08-12 03:51:12'),
(130, 1, 'admin/news/1', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:14', '2020-08-12 03:51:14'),
(131, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:16', '2020-08-12 03:51:16'),
(132, 1, 'admin/news/2', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:20', '2020-08-12 03:51:20'),
(133, 1, 'admin/companies/2/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:24', '2020-08-12 03:51:24'),
(134, 1, 'admin/news/2', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:26', '2020-08-12 03:51:26'),
(135, 1, 'admin/companies/3', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:28', '2020-08-12 03:51:28'),
(136, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:51:32', '2020-08-12 03:51:32'),
(137, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:53:54', '2020-08-12 03:53:54'),
(138, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:56:51', '2020-08-12 03:56:51'),
(139, 1, 'admin/news/4/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:57:00', '2020-08-12 03:57:00'),
(140, 1, 'admin/news/4', 'PUT', '127.0.0.1', '{\"title\":\"news test04\",\"description\":\"news desc test04\",\"status\":\"off\",\"companies\":[\"1\",\"2\",\"3\",null],\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:57:02', '2020-08-12 03:57:02'),
(141, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:57:02', '2020-08-12 03:57:02'),
(142, 1, 'admin/news/4/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 03:57:10', '2020-08-12 03:57:10'),
(143, 1, 'admin/news/4', 'PUT', '127.0.0.1', '{\"title\":\"news test04\",\"description\":\"news desc test04\",\"status\":\"on\",\"companies\":[\"1\",\"2\",\"3\",null],\"_token\":\"fuS81MDX2KNW8b9OmglvZs28jIkEnwGLydE2G4Yy\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 03:57:12', '2020-08-12 03:57:12'),
(144, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:57:12', '2020-08-12 03:57:12'),
(145, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 03:59:51', '2020-08-12 03:59:51'),
(146, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 03:59:59', '2020-08-12 03:59:59'),
(147, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:00:32', '2020-08-12 04:00:32'),
(148, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:00:35', '2020-08-12 04:00:35'),
(149, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:02:33', '2020-08-12 04:02:33'),
(150, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:04:46', '2020-08-12 04:04:46'),
(151, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '[]', '2020-08-12 04:04:53', '2020-08-12 04:04:53'),
(152, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:05:34', '2020-08-12 04:05:34'),
(153, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:05', '2020-08-12 04:06:05'),
(154, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:08', '2020-08-12 04:06:08'),
(155, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:10', '2020-08-12 04:06:10'),
(156, 1, 'admin/auth/login', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:35', '2020-08-12 04:06:35'),
(157, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:35', '2020-08-12 04:06:35'),
(158, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:36', '2020-08-12 04:06:36'),
(159, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:37', '2020-08-12 04:06:37'),
(160, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:06:39', '2020-08-12 04:06:39'),
(161, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:06:46', '2020-08-12 04:06:46'),
(162, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:06:58', '2020-08-12 04:06:58'),
(163, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:07:00', '2020-08-12 04:07:00'),
(164, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:07:03', '2020-08-12 04:07:03'),
(165, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:07:29', '2020-08-12 04:07:29'),
(166, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '[]', '2020-08-12 04:07:32', '2020-08-12 04:07:32'),
(167, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 04:08:15', '2020-08-12 04:08:15'),
(168, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:08:18', '2020-08-12 04:08:18'),
(169, 1, 'admin/companies/1', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:08:21', '2020-08-12 04:08:21'),
(170, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:08:23', '2020-08-12 04:08:23'),
(171, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:08:25', '2020-08-12 04:08:25'),
(172, 1, 'admin/news/3', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:08:27', '2020-08-12 04:08:27'),
(173, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:08:34', '2020-08-12 04:08:34'),
(174, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:09:40', '2020-08-12 04:09:40'),
(175, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:09:44', '2020-08-12 04:09:44'),
(176, 1, 'admin/auth/menu', 'POST', '127.0.0.1', '{\"parent_id\":\"0\",\"title\":null,\"icon\":\"fa-calendar\",\"uri\":null,\"roles\":[null],\"permission\":null,\"_token\":\"7i952rBwGf8DLnyGxfM1EaEB4CWdZw2QzGhnbPZW\"}', '2020-08-12 04:09:56', '2020-08-12 04:09:56'),
(177, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 04:09:56', '2020-08-12 04:09:56'),
(178, 1, 'admin/auth/menu/8/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:10:00', '2020-08-12 04:10:00'),
(179, 1, 'admin/auth/menu/8', 'PUT', '127.0.0.1', '{\"parent_id\":\"0\",\"title\":\"News\",\"icon\":\"fa-edit\",\"uri\":\"news\",\"roles\":[\"1\",null],\"permission\":null,\"_token\":\"7i952rBwGf8DLnyGxfM1EaEB4CWdZw2QzGhnbPZW\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/auth\\/menu\"}', '2020-08-12 04:10:10', '2020-08-12 04:10:10'),
(180, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 04:10:10', '2020-08-12 04:10:10'),
(181, 1, 'admin/auth/menu/9/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:10:15', '2020-08-12 04:10:15'),
(182, 1, 'admin/auth/menu/9', 'PUT', '127.0.0.1', '{\"parent_id\":\"0\",\"title\":\"Company\",\"icon\":\"fa-comments-o\",\"uri\":\"companies\",\"roles\":[\"1\",null],\"permission\":null,\"_token\":\"7i952rBwGf8DLnyGxfM1EaEB4CWdZw2QzGhnbPZW\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/auth\\/menu\"}', '2020-08-12 04:10:30', '2020-08-12 04:10:30'),
(183, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 04:10:30', '2020-08-12 04:10:30'),
(184, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 04:10:32', '2020-08-12 04:10:32'),
(185, 1, 'admin/auth/menu', 'GET', '127.0.0.1', '[]', '2020-08-12 04:10:32', '2020-08-12 04:10:32'),
(186, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:10:34', '2020-08-12 04:10:34'),
(187, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:10:36', '2020-08-12 04:10:36'),
(188, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 04:10:44', '2020-08-12 04:10:44'),
(189, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:10:45', '2020-08-12 04:10:45'),
(190, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:10:53', '2020-08-12 04:10:53'),
(191, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:10:57', '2020-08-12 04:10:57'),
(192, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 04:14:19', '2020-08-12 04:14:19'),
(193, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:14:22', '2020-08-12 04:14:22'),
(194, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:14:38', '2020-08-12 04:14:38'),
(195, 1, 'admin/news/1/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:14:40', '2020-08-12 04:14:40'),
(196, 1, 'admin/news/1', 'PUT', '127.0.0.1', '{\"title\":\"news test01\",\"description\":\"news test01 desc\",\"status\":\"off\",\"companies\":[\"1\",null],\"_token\":\"gV8Y8aJDHNApwHHBo4Uz9p8DRXUlEHz53F2vIMuh\",\"after-save\":\"3\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 04:14:43', '2020-08-12 04:14:43'),
(197, 1, 'admin/news/1', 'GET', '127.0.0.1', '[]', '2020-08-12 04:14:44', '2020-08-12 04:14:44'),
(198, 1, 'admin/news/1/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:14:48', '2020-08-12 04:14:48'),
(199, 1, 'admin/news/1', 'PUT', '127.0.0.1', '{\"title\":\"news test01\",\"description\":\"news test01 desc\",\"status\":\"on\",\"companies\":[\"1\",null],\"_token\":\"gV8Y8aJDHNApwHHBo4Uz9p8DRXUlEHz53F2vIMuh\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\\/1\"}', '2020-08-12 04:14:49', '2020-08-12 04:14:49'),
(200, 1, 'admin/news/1', 'GET', '127.0.0.1', '[]', '2020-08-12 04:14:50', '2020-08-12 04:14:50'),
(201, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:15:14', '2020-08-12 04:15:14'),
(202, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:15:19', '2020-08-12 04:15:19'),
(203, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:15:21', '2020-08-12 04:15:21'),
(204, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:16:41', '2020-08-12 04:16:41'),
(205, 1, 'admin/auth/login', 'GET', '127.0.0.1', '[]', '2020-08-12 04:16:46', '2020-08-12 04:16:46'),
(206, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:17:03', '2020-08-12 04:17:03'),
(207, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:17:04', '2020-08-12 04:17:04'),
(208, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:17:06', '2020-08-12 04:17:06'),
(209, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:17:11', '2020-08-12 04:17:11'),
(210, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 04:18:08', '2020-08-12 04:18:08'),
(211, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:18:11', '2020-08-12 04:18:11'),
(212, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:18:13', '2020-08-12 04:18:13'),
(213, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:18:15', '2020-08-12 04:18:15'),
(214, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 04:18:18', '2020-08-12 04:18:18'),
(215, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:18:23', '2020-08-12 04:18:23'),
(216, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:18:24', '2020-08-12 04:18:24'),
(217, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:19:07', '2020-08-12 04:19:07'),
(218, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:19:08', '2020-08-12 04:19:08'),
(219, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:19:47', '2020-08-12 04:19:47'),
(220, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:19:49', '2020-08-12 04:19:49'),
(221, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:19:50', '2020-08-12 04:19:50'),
(222, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:19:51', '2020-08-12 04:19:51'),
(223, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:21:21', '2020-08-12 04:21:21'),
(224, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 04:21:51', '2020-08-12 04:21:51'),
(225, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 04:21:52', '2020-08-12 04:21:52'),
(226, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 04:22:11', '2020-08-12 04:22:11'),
(227, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:22:12', '2020-08-12 04:22:12'),
(228, 1, 'admin/companies/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:22:13', '2020-08-12 04:22:13'),
(229, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:22:16', '2020-08-12 04:22:16'),
(230, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 04:22:46', '2020-08-12 04:22:46'),
(231, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 04:22:46', '2020-08-12 04:22:46'),
(232, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:22:47', '2020-08-12 04:22:47'),
(233, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:22:49', '2020-08-12 04:22:49'),
(234, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:22:51', '2020-08-12 04:22:51'),
(235, 1, 'admin/companies', 'GET', '127.0.0.1', '[]', '2020-08-12 04:25:29', '2020-08-12 04:25:29'),
(236, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:26:05', '2020-08-12 04:26:05'),
(237, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:26:07', '2020-08-12 04:26:07'),
(238, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:26:08', '2020-08-12 04:26:08'),
(239, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:26:11', '2020-08-12 04:26:11'),
(240, 1, 'admin/auth/setting', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:26:28', '2020-08-12 04:26:28'),
(241, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:27:01', '2020-08-12 04:27:01'),
(242, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\",\"_export_\":\"all\"}', '2020-08-12 04:27:15', '2020-08-12 04:27:15'),
(243, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_columns_\":\"id\",\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:27:42', '2020-08-12 04:27:42'),
(244, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_columns_\":\"id,status,title\",\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:27:46', '2020-08-12 04:27:46'),
(245, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:27:48', '2020-08-12 04:27:48'),
(246, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:27:52', '2020-08-12 04:27:52'),
(247, 1, 'admin/auth/permissions', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:27:59', '2020-08-12 04:27:59'),
(248, 1, 'admin/auth/roles', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:28:07', '2020-08-12 04:28:07'),
(249, 1, 'admin/auth/users', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:28:08', '2020-08-12 04:28:08'),
(250, 1, 'admin/auth/users', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:28:11', '2020-08-12 04:28:11'),
(251, 1, 'admin/auth/users/1/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:28:13', '2020-08-12 04:28:13'),
(252, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:28:16', '2020-08-12 04:28:16'),
(253, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:29:08', '2020-08-12 04:29:08'),
(254, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:30:56', '2020-08-12 04:30:56'),
(255, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:30:59', '2020-08-12 04:30:59'),
(256, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:31:00', '2020-08-12 04:31:00'),
(257, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:31:01', '2020-08-12 04:31:01'),
(258, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:41:26', '2020-08-12 04:41:26'),
(259, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:41:28', '2020-08-12 04:41:28'),
(260, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:41:32', '2020-08-12 04:41:32'),
(261, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:41:38', '2020-08-12 04:41:38'),
(262, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:46:21', '2020-08-12 04:46:21'),
(263, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:46:22', '2020-08-12 04:46:22'),
(264, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:46:22', '2020-08-12 04:46:22'),
(265, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:48:52', '2020-08-12 04:48:52'),
(266, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:48:55', '2020-08-12 04:48:55'),
(267, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:49:03', '2020-08-12 04:49:03'),
(268, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 04:49:10', '2020-08-12 04:49:10'),
(269, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:49:41', '2020-08-12 04:49:41'),
(270, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:49:43', '2020-08-12 04:49:43'),
(271, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:49:44', '2020-08-12 04:49:44'),
(272, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:49:45', '2020-08-12 04:49:45'),
(273, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:49:57', '2020-08-12 04:49:57'),
(274, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:49:58', '2020-08-12 04:49:58'),
(275, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:50:02', '2020-08-12 04:50:02'),
(276, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:50:03', '2020-08-12 04:50:03'),
(277, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:50:07', '2020-08-12 04:50:07'),
(278, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:50:23', '2020-08-12 04:50:23'),
(279, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:50:29', '2020-08-12 04:50:29'),
(280, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:51:48', '2020-08-12 04:51:48'),
(281, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:51:49', '2020-08-12 04:51:49'),
(282, 1, 'admin/companies/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:51:59', '2020-08-12 04:51:59'),
(283, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:52:01', '2020-08-12 04:52:01'),
(284, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 04:52:02', '2020-08-12 04:52:02'),
(285, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:24:43', '2020-08-12 05:24:43'),
(286, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:24:43', '2020-08-12 05:24:43'),
(287, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 05:24:49', '2020-08-12 05:24:49'),
(288, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:25:43', '2020-08-12 05:25:43'),
(289, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:25:51', '2020-08-12 05:25:51'),
(290, 1, 'admin/news/create', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:25:52', '2020-08-12 05:25:52'),
(291, 1, 'admin/news', 'POST', '127.0.0.1', '{\"title\":\"news test05\",\"description\":null,\"status\":\"off\",\"companies\":[null],\"_token\":\"8lKMJGDohCv4ffq8KUZo3vLGSeOCMTmEYSTWFNFD\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 05:26:04', '2020-08-12 05:26:04'),
(292, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 05:26:05', '2020-08-12 05:26:05'),
(293, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 05:26:56', '2020-08-12 05:26:56'),
(294, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 05:26:57', '2020-08-12 05:26:57'),
(295, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 05:27:03', '2020-08-12 05:27:03'),
(296, 1, 'admin/news/create', 'GET', '127.0.0.1', '[]', '2020-08-12 05:27:04', '2020-08-12 05:27:04'),
(297, 1, 'admin/news', 'POST', '127.0.0.1', '{\"title\":\"news test05\",\"description\":\"news test05 desc\",\"status\":\"off\",\"companies\":[null],\"_token\":\"8lKMJGDohCv4ffq8KUZo3vLGSeOCMTmEYSTWFNFD\"}', '2020-08-12 05:27:19', '2020-08-12 05:27:19'),
(298, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 05:27:20', '2020-08-12 05:27:20'),
(299, 1, 'admin/news/5/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:27:26', '2020-08-12 05:27:26'),
(300, 1, 'admin/news/5', 'PUT', '127.0.0.1', '{\"title\":\"news test05\",\"description\":\"news test05 desc\",\"status\":\"on\",\"companies\":[null],\"_token\":\"8lKMJGDohCv4ffq8KUZo3vLGSeOCMTmEYSTWFNFD\",\"_method\":\"PUT\",\"_previous_\":\"http:\\/\\/intelliants\\/admin\\/news\"}', '2020-08-12 05:27:28', '2020-08-12 05:27:28'),
(301, 1, 'admin/news', 'GET', '127.0.0.1', '[]', '2020-08-12 05:27:28', '2020-08-12 05:27:28'),
(302, 1, 'admin/news/5/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:27:40', '2020-08-12 05:27:40'),
(303, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:28:22', '2020-08-12 05:28:22'),
(304, 1, 'admin/news/5/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:28:25', '2020-08-12 05:28:25'),
(305, 1, 'admin/news', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:28:27', '2020-08-12 05:28:27'),
(306, 1, 'admin/news/1/edit', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:28:29', '2020-08-12 05:28:29'),
(307, 1, 'admin', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:28:33', '2020-08-12 05:28:33'),
(308, 1, 'admin/auth/logout', 'GET', '127.0.0.1', '[]', '2020-08-12 05:29:05', '2020-08-12 05:29:05'),
(309, 1, 'admin', 'GET', '127.0.0.1', '[]', '2020-08-12 05:29:22', '2020-08-12 05:29:22'),
(310, 1, 'admin/companies', 'GET', '127.0.0.1', '{\"_pjax\":\"#pjax-container\"}', '2020-08-12 05:29:26', '2020-08-12 05:29:26');

-- --------------------------------------------------------

--
-- Структура таблицы `admin_permissions`
--

CREATE TABLE `admin_permissions` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `http_method` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `http_path` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_permissions`
--

INSERT INTO `admin_permissions` (`id`, `name`, `slug`, `http_method`, `http_path`, `created_at`, `updated_at`) VALUES
(1, 'All permission', '*', '', '*', NULL, NULL),
(2, 'Dashboard', 'dashboard', 'GET', '/', NULL, NULL),
(3, 'Login', 'auth.login', '', '/auth/login\r\n/auth/logout', NULL, NULL),
(4, 'User setting', 'auth.setting', 'GET,PUT', '/auth/setting', NULL, NULL),
(5, 'Auth management', 'auth.management', '', '/auth/roles\r\n/auth/permissions\r\n/auth/menu\r\n/auth/logs', NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `admin_roles`
--

CREATE TABLE `admin_roles` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_roles`
--

INSERT INTO `admin_roles` (`id`, `name`, `slug`, `created_at`, `updated_at`) VALUES
(1, 'Administrator', 'administrator', '2020-08-12 03:00:09', '2020-08-12 03:00:09');

-- --------------------------------------------------------

--
-- Структура таблицы `admin_role_menu`
--

CREATE TABLE `admin_role_menu` (
  `role_id` int(11) NOT NULL,
  `menu_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_role_menu`
--

INSERT INTO `admin_role_menu` (`role_id`, `menu_id`, `created_at`, `updated_at`) VALUES
(1, 2, NULL, NULL),
(1, 8, NULL, NULL),
(1, 9, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `admin_role_permissions`
--

CREATE TABLE `admin_role_permissions` (
  `role_id` int(11) NOT NULL,
  `permission_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_role_permissions`
--

INSERT INTO `admin_role_permissions` (`role_id`, `permission_id`, `created_at`, `updated_at`) VALUES
(1, 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `admin_role_users`
--

CREATE TABLE `admin_role_users` (
  `role_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_role_users`
--

INSERT INTO `admin_role_users` (`role_id`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `admin_users`
--

CREATE TABLE `admin_users` (
  `id` int(10) UNSIGNED NOT NULL,
  `username` varchar(190) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `avatar` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `admin_users`
--

INSERT INTO `admin_users` (`id`, `username`, `password`, `name`, `avatar`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'admin', '$2y$10$fNksMKPUpcEUKX4hMJFVjuxVJW26qL/sFWYLQtUYWkbrt5TJO5Iay', 'Administrator', NULL, 'CVT3btNFTZirZ02BxGAR1zmAC50ZJuOaJC9Q0ennLZxFT2txgAQt9LWa5Ze1', '2020-08-12 03:00:09', '2020-08-12 03:00:09');

-- --------------------------------------------------------

--
-- Структура таблицы `admin_user_permissions`
--

CREATE TABLE `admin_user_permissions` (
  `user_id` int(11) NOT NULL,
  `permission_id` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `companies`
--

CREATE TABLE `companies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `status` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `companies`
--

INSERT INTO `companies` (`id`, `title`, `description`, `date`, `status`, `created_at`, `updated_at`) VALUES
(1, 'company test01', 'company desc test01', '2020-08-12', 1, '2020-08-12 03:00:46', '2020-08-12 03:16:57'),
(2, 'company test02', 'company desc test02', '2020-08-12', 1, '2020-08-12 03:01:01', '2020-08-12 03:17:01'),
(3, 'company test03', 'company desc test03', '2020-08-12', 0, '2020-08-12 03:17:12', '2020-08-12 03:17:12');

-- --------------------------------------------------------

--
-- Структура таблицы `company_news`
--

CREATE TABLE `company_news` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `news_id` int(11) NOT NULL,
  `company_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `company_news`
--

INSERT INTO `company_news` (`id`, `news_id`, `company_id`) VALUES
(1, 1, 1),
(2, 2, 1),
(3, 2, 2),
(4, 3, 1),
(5, 3, 2),
(6, 4, 1),
(7, 4, 2),
(8, 4, 3);

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(8, '2014_10_12_000000_create_users_table', 1),
(9, '2014_10_12_100000_create_password_resets_table', 1),
(10, '2016_01_04_173148_create_admin_tables', 1),
(11, '2019_08_19_000000_create_failed_jobs_table', 1),
(12, '2020_08_12_051635_create_companies_table', 1),
(13, '2020_08_12_051911_create_news_table', 1),
(14, '2020_08_12_085325_create_news_company_table', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE `news` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `title`, `description`, `status`, `created_at`, `updated_at`) VALUES
(1, 'news test01', 'news test01 desc', 1, '2020-08-12 03:00:54', '2020-08-12 04:14:49'),
(2, 'news test02', 'news desc test02', 1, '2020-08-12 03:01:10', '2020-08-12 03:17:21'),
(3, 'news test03', 'news desc test03', 0, '2020-08-12 03:04:29', '2020-08-12 03:04:29'),
(4, 'news test04', 'news desc test04', 1, '2020-08-12 03:17:42', '2020-08-12 03:57:12'),
(5, 'news test05', 'news test05 desc', 1, '2020-08-12 05:27:20', '2020-08-12 05:27:28');

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `admin_menu`
--
ALTER TABLE `admin_menu`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `admin_operation_log`
--
ALTER TABLE `admin_operation_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `admin_operation_log_user_id_index` (`user_id`);

--
-- Индексы таблицы `admin_permissions`
--
ALTER TABLE `admin_permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `admin_permissions_name_unique` (`name`),
  ADD UNIQUE KEY `admin_permissions_slug_unique` (`slug`);

--
-- Индексы таблицы `admin_roles`
--
ALTER TABLE `admin_roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `admin_roles_name_unique` (`name`),
  ADD UNIQUE KEY `admin_roles_slug_unique` (`slug`);

--
-- Индексы таблицы `admin_role_menu`
--
ALTER TABLE `admin_role_menu`
  ADD KEY `admin_role_menu_role_id_menu_id_index` (`role_id`,`menu_id`);

--
-- Индексы таблицы `admin_role_permissions`
--
ALTER TABLE `admin_role_permissions`
  ADD KEY `admin_role_permissions_role_id_permission_id_index` (`role_id`,`permission_id`);

--
-- Индексы таблицы `admin_role_users`
--
ALTER TABLE `admin_role_users`
  ADD KEY `admin_role_users_role_id_user_id_index` (`role_id`,`user_id`);

--
-- Индексы таблицы `admin_users`
--
ALTER TABLE `admin_users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `admin_users_username_unique` (`username`);

--
-- Индексы таблицы `admin_user_permissions`
--
ALTER TABLE `admin_user_permissions`
  ADD KEY `admin_user_permissions_user_id_permission_id_index` (`user_id`,`permission_id`);

--
-- Индексы таблицы `companies`
--
ALTER TABLE `companies`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `company_news`
--
ALTER TABLE `company_news`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `admin_menu`
--
ALTER TABLE `admin_menu`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `admin_operation_log`
--
ALTER TABLE `admin_operation_log`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=311;

--
-- AUTO_INCREMENT для таблицы `admin_permissions`
--
ALTER TABLE `admin_permissions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `admin_roles`
--
ALTER TABLE `admin_roles`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `admin_users`
--
ALTER TABLE `admin_users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `companies`
--
ALTER TABLE `companies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `company_news`
--
ALTER TABLE `company_news`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
